wst/tags/0.6/tests/test_suite/files/write_header_simple_content_1.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header xmlns:ns1="urn:simple-content-header.sample">
    <ns1:TSampleSimpleContentHeaderBlock_A>sample header simple content value</ns1:TSampleSimpleContentHeaderBlock_A>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <ns2:test_proc xmlns:ns2="TestService"/>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
